snappyHexMesh_2mmRestrictor/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:  3.0                                   |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "6e-08";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// PMDI nozzle - D Duke, LTRAC, Monash University
// daniel.duke@monash.edu
// Last Updated 12/08/18
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    
    inlet //inflow boundary
    {
	    type            zeroGradient; //pressureInletOutletVelocity;
        outletValue     uniform (0 0 0);
        value           uniform (0 0 0);
    }
    
    outlet_axial //outflow boundary
    {
  	    type            zeroGradient; //pressureInletOutletVelocity;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    outlet_radial //outflow boundary
    {
  	    type            zeroGradient; //pressureInletOutletVelocity;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
